## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # zentral_mdm_artifact.mscp-firewall will be created
  + resource "zentral_mdm_artifact" "mscp-firewall" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "mSCP - firewall"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_blueprint_artifact.mscp-firewall will be created
  + resource "zentral_mdm_blueprint_artifact" "mscp-firewall" {
      + artifact_id        = (known after apply)
      + blueprint_id       = 1
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_profile.mscp-firewall-1 will be created
  + resource "zentral_mdm_profile" "mscp-firewall-1" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + source             = "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxLjAiPgo8ZGljdD4KCTxrZXk+Q29uc2VudFRleHQ8L2tleT4KCTxkaWN0PgoJCTxrZXk+ZGVmYXVsdDwva2V5PgoJCTxzdHJpbmc+VEhFIFNPRlRXQVJFIElTIFBST1ZJREVEICdBUyBJUycgV0lUSE9VVCBBTlkgV0FSUkFOVFkgT0YgQU5ZIEtJTkQsIEVJVEhFUiBFWFBSRVNTRUQsIElNUExJRUQsIE9SIFNUQVRVVE9SWSwgSU5DTFVESU5HLCBCVVQgTk9UIExJTUlURUQgVE8sIEFOWSBXQVJSQU5UWSBUSEFUIFRIRSBTT0ZUV0FSRSBXSUxMIENPTkZPUk0gVE8gU1BFQ0lGSUNBVElPTlMsIEFOWSBJTVBMSUVEIFdBUlJBTlRJRVMgT0YgTUVSQ0hBTlRBQklMSVRZLCBGSVRORVNTIEZPUiBBIFBBUlRJQ1VMQVIgUFVSUE9TRSwgQU5EIEZSRUVET00gRlJPTSBJTkZSSU5HRU1FTlQsIEFORCBBTlkgV0FSUkFOVFkgVEhBVCBUSEUgRE9DVU1FTlRBVElPTiBXSUxMIENPTkZPUk0gVE8gVEhFIFNPRlRXQVJFLCBPUiBBTlkgV0FSUkFOVFkgVEhBVCBUSEUgU09GVFdBUkUgV0lMTCBCRSBFUlJPUiBGUkVFLiAgSU4gTk8gRVZFTlQgU0hBTEwgTklTVCBCRSBMSUFCTEUgRk9SIEFOWSBEQU1BR0VTLCBJTkNMVURJTkcsIEJVVCBOT1QgTElNSVRFRCBUTywgRElSRUNULCBJTkRJUkVDVCwgU1BFQ0lBTCBPUiBDT05TRVFVRU5USUFMIERBTUFHRVMsIEFSSVNJTkcgT1VUIE9GLCBSRVNVTFRJTkcgRlJPTSwgT1IgSU4gQU5ZIFdBWSBDT05ORUNURUQgV0lUSCBUSElTIFNPRlRXQVJFLCBXSEVUSEVSIE9SIE5PVCBCQVNFRCBVUE9OIFdBUlJBTlRZLCBDT05UUkFDVCwgVE9SVCwgT1IgT1RIRVJXSVNFLCBXSEVUSEVSIE9SIE5PVCBJTkpVUlkgV0FTIFNVU1RBSU5FRCBCWSBQRVJTT05TIE9SIFBST1BFUlRZIE9SIE9USEVSV0lTRSwgQU5EIFdIRVRIRVIgT1IgTk9UIExPU1MgV0FTIFNVU1RBSU5FRCBGUk9NLCBPUiBBUk9TRSBPVVQgT0YgVEhFIFJFU1VMVFMgT0YsIE9SIFVTRSBPRiwgVEhFIFNPRlRXQVJFIE9SIFNFUlZJQ0VTIFBST1ZJREVEIEhFUkVVTkRFUi48L3N0cmluZz4KCTwvZGljdD4KCTxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KCTxhcnJheT4KCQk8ZGljdD4KCQkJPGtleT5FbmFibGVGaXJld2FsbDwva2V5PgoJCQk8dHJ1ZS8+CgkJCTxrZXk+RW5hYmxlTG9nZ2luZzwva2V5PgoJCQk8dHJ1ZS8+CgkJCTxrZXk+RW5hYmxlU3RlYWx0aE1vZGU8L2tleT4KCQkJPHRydWUvPgoJCQk8a2V5PkxvZ2dpbmdPcHRpb248L2tleT4KCQkJPHN0cmluZz5kZXRhaWw8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5PgoJCQk8c3RyaW5nPmFsYWNhcnRlLm1hY09TLllvbG8uOTgxNjk2YmYtYWVkZS00ODhiLTk2MTMtNDllMmY1YjRiOTgxPC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZFR5cGU8L2tleT4KCQkJPHN0cmluZz5jb20uYXBwbGUuc2VjdXJpdHkuZmlyZXdhbGw8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkVVVJRDwva2V5PgoJCQk8c3RyaW5nPjk4MTY5NmJmLWFlZGUtNDg4Yi05NjEzLTQ5ZTJmNWI0Yjk4MTwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+CgkJCTxpbnRlZ2VyPjE8L2ludGVnZXI+CgkJPC9kaWN0PgoJPC9hcnJheT4KCTxrZXk+UGF5bG9hZERlc2NyaXB0aW9uPC9rZXk+Cgk8c3RyaW5nPkNyZWF0ZWQ6IDIwMjQtMDctMDkKQ29uZmlndXJhdGlvbiBzZXR0aW5ncyBmb3IgdGhlIGNvbS5hcHBsZS5zZWN1cml0eS5maXJld2FsbCBwcmVmZXJlbmNlIGRvbWFpbi48L3N0cmluZz4KCTxrZXk+UGF5bG9hZERpc3BsYXlOYW1lPC9rZXk+Cgk8c3RyaW5nPltZb2xvXSBjb20uYXBwbGUuc2VjdXJpdHkuZmlyZXdhbGwgc2V0dGluZ3M8L3N0cmluZz4KCTxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KCTxzdHJpbmc+Y29tLmFwcGxlLnNlY3VyaXR5LmZpcmV3YWxsLllvbG88L3N0cmluZz4KCTxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5PgoJPHN0cmluZz5tYWNPUyBTZWN1cml0eSBDb21wbGlhbmNlIFByb2plY3Q8L3N0cmluZz4KCTxrZXk+UGF5bG9hZFNjb3BlPC9rZXk+Cgk8c3RyaW5nPlN5c3RlbTwvc3RyaW5nPgoJPGtleT5QYXlsb2FkVHlwZTwva2V5PgoJPHN0cmluZz5Db25maWd1cmF0aW9uPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRVVUlEPC9rZXk+Cgk8c3RyaW5nPjcxYzJlOWJiLTQxYzEtNDlkYy04NWUwLWZmNGRmYmM3ZDJhZTwvc3RyaW5nPgoJPGtleT5QYXlsb2FkVmVyc2lvbjwva2V5PgoJPGludGVnZXI+MTwvaW50ZWdlcj4KPC9kaWN0Pgo8L3BsaXN0Pgo="
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

  # zentral_monolith_manifest_sub_manifest.default-apps will be created
  + resource "zentral_monolith_manifest_sub_manifest" "default-apps" {
      + id              = (known after apply)
      + manifest_id     = 1
      + sub_manifest_id = (known after apply)
      + tag_ids         = (known after apply)
    }

  # zentral_monolith_sub_manifest.apps will be created
  + resource "zentral_monolith_sub_manifest" "apps" {
      + description = "The mandatory apps for our standard macOS client"
      + id          = (known after apply)
      + name        = "Mandatory apps"
    }

  # zentral_monolith_sub_manifest_pkg_info.onepassword will be created
  + resource "zentral_monolith_sub_manifest_pkg_info" "onepassword" {
      + default_shard    = 100
      + excluded_tag_ids = []
      + featured_item    = false
      + id               = (known after apply)
      + key              = "managed_installs"
      + pkg_info_name    = "1Password"
      + shard_modulo     = 100
      + sub_manifest_id  = (known after apply)
      + tag_shards       = []
    }

  # zentral_munki_configuration.default will be updated in-place
  ~ resource "zentral_munki_configuration" "default" {
        id                                  = 1
      ~ name                                = "Default" -> "Default 🫁"
      ~ version                             = 0 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # zentral_osquery_configuration.default will be updated in-place
  ~ resource "zentral_osquery_configuration" "default" {
        id                 = 1
      ~ name               = "Default" -> "Default 😛"
        # (8 unchanged attributes hidden)
    }

  # zentral_osquery_configuration_pack.default-compliance-checks will be created
  + resource "zentral_osquery_configuration_pack" "default-compliance-checks" {
      + configuration_id = 1
      + id               = (known after apply)
      + pack_id          = (known after apply)
      + tag_ids          = (known after apply)
    }

  # zentral_osquery_pack.compliance-checks will be created
  + resource "zentral_osquery_pack" "compliance-checks" {
      + description       = "The compliance checks for our macOS client"
      + discovery_queries = (known after apply)
      + id                = (known after apply)
      + name              = "Compliance checks"
      + slug              = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # zentral_osquery_query.santa-sysext-cc will be created
  + resource "zentral_osquery_query" "santa-sysext-cc" {
      + compliance_check_enabled = true
      + description              = "Check if the Santa system extension is activated, running and up-to-date"
      + id                       = (known after apply)
      + name                     = "Santa system extension check"
      + platforms                = [
          + "darwin",
        ]
      + scheduling               = {
          + can_be_denylisted   = true
          + interval            = 3600
          + log_removed_actions = false
          + pack_id             = (known after apply)
          + snapshot_mode       = true
        }
      + sql                      = <<-EOT
            WITH expected_sysexts(team, identifier, min_version) AS (
              VALUES ('EQHXZ8M8AV', 'com.google.santa.daemon', '2024.5')
            ), found_sysexts AS (
              SELECT expected_sysexts.*, system_extensions.version, system_extensions.state,
              CASE
                WHEN system_extensions.version >= expected_sysexts.min_version
                  AND system_extensions.state == 'activated_enabled'
                THEN 'OK'
                ELSE 'FAILED'
              END individual_ztl_status
              FROM expected_sysexts
              LEFT JOIN system_extensions ON (
                system_extensions.team = expected_sysexts.team
                AND system_extensions.identifier = expected_sysexts.identifier
              )
            ) SELECT team, identifier, version, state, MAX(individual_ztl_status) OVER () ztl_status
            FROM found_sysexts
        EOT
      + value                    = ""
      + version                  = (known after apply)
    }

  # zentral_santa_configuration.default will be updated in-place
  ~ resource "zentral_santa_configuration" "default" {
        id                            = 1
      ~ name                          = "Default" -> "Weird"
        # (13 unchanged attributes hidden)
    }

  # zentral_santa_rule.signingid-yes will be created
  + resource "zentral_santa_rule" "signingid-yes" {
      + configuration_id        = 1
      + custom_message          = "No yes 🕶️"
      + description             = "Say no to yes!"
      + excluded_primary_users  = []
      + excluded_serial_numbers = []
      + excluded_tag_ids        = []
      + id                      = (known after apply)
      + policy                  = "BLOCKLIST"
      + primary_users           = []
      + ruleset_id              = (known after apply)
      + serial_numbers          = []
      + tag_ids                 = []
      + target_identifier       = "platform:com.apple.yes"
      + target_type             = "SIGNINGID"
      + version                 = (known after apply)
    }

  # zentral_santa_rule.teamid-macpaw will be created
  + resource "zentral_santa_rule" "teamid-macpaw" {
      + configuration_id        = 1
      + custom_message          = "No MacPaw apps are allowed!!!"
      + description             = "Block MacPaw apps, mostly for demo purposes"
      + excluded_primary_users  = []
      + excluded_serial_numbers = []
      + excluded_tag_ids        = []
      + id                      = (known after apply)
      + policy                  = "BLOCKLIST"
      + primary_users           = []
      + ruleset_id              = (known after apply)
      + serial_numbers          = []
      + tag_ids                 = []
      + target_identifier       = "S8EX82NJP6"
      + target_type             = "TEAMID"
      + version                 = (known after apply)
    }

Plan: 11 to add, 3 to change, 0 to destroy.
```
</details>